Autodesk.Revit.DB.IFC.IFCHybridImport.CreateMap(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Creates a map to look up ElementIds, given an IFC GUID as input.
doc:
Document containing Elements.
elementIds:
ElementIds that are candidates for association.
Returns:
Returns map associating ElementId with a specific IFC GUID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.IFC.IFCHybridImport.UpdateElements(Autodesk.Revit.DB.Document,System.String)
Updates IFC Elements using AnyCAD.
doc:
Document to receive elements from the IFC file update.
file:
Full path of the file to import.
Returns:
Returns an array of ElementIds representing created or updated elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024.1